app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 101
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0

  def index
    @users = User.paginate(page: params[:page])
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 30 OFFSET 0

   def create
     @user = User.new(params[:user])
     if @user.save
---
INSERT INTO `users` (`admin`, `created_at`, `email`, `name`, `password_digest`, `remember_token`, `updated_at`) VALUES (0, '2012-12-26 08:36:47', 'amol@gmail.com', 'Amol', '$2a$10$xkv8VPZizZ30UIELoWvoc.owQjZmIQFuNxZ5NdnIZVew.35R.I05u', '4OWZcJNkEjehLG8f3pffQA', '2012-12-26 08:36:47')

     def following
       @title = "Following"
       @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1

     def followers
       @title = "Followers"
       @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1